# 4.9 - Intro to Data Visualization with Python

## Importing libraries

In [1]:
# Import libraries

import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

## 01. Importing dataframes

In [2]:
# Create folder path

path = r'/Users/edytakowal/Desktop/Instacart Basket Analysis'

In [3]:
# Import the customers.csv dataframe from the csv file

df = pd.read_csv(os.path.join(path, '02 Data', 'Oryginal Data', 'customers.csv'))

## 04. Wrangle the data so that it follows consistent logic; for example, rename columns with illogical names and drop columns that don’t add anything to your analysis.

In [4]:
# Check the dimension of df

df.shape

(206209, 10)

In [5]:
# Check the first 5 rows of the df

df.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [6]:
# Drop coulumns

df.drop(columns = ['First Name', 'Surnam'], inplace = True)

In [7]:
# Rename columns

df.rename(columns = {'Gender' : 'gender',
                    'STATE' : 'state',
                    'Age' : 'age',
                    'date_joined' : 'joining_date',
                    }, inplace = True)

## 05. Complete the fundamental data quality and consistency checks you’ve learned throughout this Achievement; for example, check for and address missing values and duplicates, and convert any mixed-type data.

In [8]:
# Find missing values

df.isnull().sum()

user_id         0
gender          0
state           0
age             0
joining_date    0
n_dependants    0
fam_status      0
income          0
dtype: int64

The missing values are only in first_name column, so I decided not to do anything and leave it as it is.

In [9]:
# Create a  subset containing only rows that are duplicates

df_dups = df[df.duplicated()]

In [10]:
df_dups

Empty DataFrame
Columns: [user_id, gender, state, age, joining_date, n_dependants, fam_status, income]
Index: []

No duplicates found

In [11]:
# Check the data types of columns

df.dtypes

user_id          int64
gender          object
state           object
age              int64
joining_date    object
n_dependants     int64
fam_status      object
income           int64
dtype: object

In [33]:
# Change the data type of columns from number to string

df['user_id'] = df['user_id'].astype('str')

In [13]:
# Change the data type of columns from object to category

df[['gender', 'state', 'fam_status']] = df[['gender', 'state', 'fam_status']].astype('category')

In [14]:
# Check for mixed data types 

for col in df.columns.tolist():
  weird = (df[[col]].applymap(type) != df[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df[weird]) > 0:
    print (col)

## 07. Combine your customer data with the rest of your prepared Instacart data. (Hint: Make sure the key columns are the same data type!)

In [15]:
# Import the orders_products_merged_new.pkl dataframe from the pkl file

ords_prods_merged = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_merged_new.pkl'))

In [16]:
# Check the dimension of 'ords_prods_merged'

ords_prods_merged.shape

(32404859, 24)

In [17]:
ords_prods_merged.info(memory_usage = 'deep')

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32404859 entries, 0 to 32404858
Data columns (total 24 columns):
 #   Column                  Dtype
---  ------                  -----
 0   Unnamed: 0_x            int64
 1   product_id              int64
 2   product_name            object
 3   aisle_id                int64
 4   department_id           int64
 5   prices                  float64
 6   Unnamed: 0_y            int64
 7   Unnamed: 0.1            int64
 8   order_id                int64
 9   user_id                 int64
 10  order_number            int64
 11  orders_day_of_week      int64
 12  order_hour              int64
 13  days_since_prior_order  float64
 14  add_to_cart_order       int64
 15  reordered               int64
 16  _merge                  category
 17  exists                  category
 18  max_order               int64
 19  loyalty_flag            object
 20  avg_product_price       float64
 21  spending_flag           object
 22  median_order_freq       float64
 23  freq_flag               object
dtypes: category(2), float64(4), int64(14), object(4)
memory usage: 13.6 GB

In [20]:
# Change the data type of columns from object to category

ords_prods_merged[['loyalty_flag', 'spending_flag', 'freq_flag']] = ords_prods_merged[['loyalty_flag', 'spending_flag', 'freq_flag']].astype('category')

In [21]:
# Check the firse 5 rows of 'ords_prods_merged'

ords_prods_merged.head()

,Unnamed: 0_x,product_id,product_name,aisle_id,department_id,prices,Unnamed: 0_y,Unnamed: 0.1,order_id,user_id,...,add_to_cart_order,reordered,_merge,exists,max_order,loyalty_flag,avg_product_price,spending_flag,median_order_freq,freq_flag
0,0,1,Chocolate Sandwich Cookies,61,19,5.8,1987,1987,3139998,138,...,5,0,both,both,32,Regular customer,6.935811,Low spender,8.0,Frequent customer
1,0,1,Chocolate Sandwich Cookies,61,19,5.8,1989,1989,1977647,138,...,1,1,both,both,32,Regular customer,6.935811,Low spender,8.0,Frequent customer
2,0,1,Chocolate Sandwich Cookies,61,19,5.8,11433,11433,389851,709,...,20,0,both,both,5,New customer,7.930208,Low spender,8.0,Frequent customer
3,0,1,Chocolate Sandwich Cookies,61,19,5.8,12198,12198,652770,764,...,10,0,both,both,3,New customer,4.972414,Low spender,9.0,Frequent customer
4,0,1,Chocolate Sandwich Cookies,61,19,5.8,12200,12200,1813452,764,...,11,1,both,both,3,New customer,4.972414,Low spender,9.0,Frequent customer

In [22]:
# Check the data types of df

df.dtypes

user_id           object
gender          category
state           category
age               object
joining_date      object
n_dependants       int64
fam_status      category
income             int64
dtype: object

In [23]:
# Change the data type of key column- 'user_id' in the 'ords_prods_merged' from number to string

ords_prods_merged[['user_id']] = ords_prods_merged[['user_id']].astype('str')

In [24]:
# Merge df and ords_prods_merged using 'user_id' column as a key

order_products_all = df.merge(ords_prods_merged, on = 'user_id', indicator = 'exis')

In [25]:
# Check dimension of order_products_all

order_products_all.shape

(32404859, 32)

In [26]:
order_products_all.info(memory_usage = 'deep')

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32404859 entries, 0 to 32404858
Data columns (total 32 columns):
 #   Column                  Dtype
---  ------                  -----
 0   user_id                 object
 1   gender                  category
 2   state                   category
 3   age                     object
 4   joining_date            object
 5   n_dependants            int64
 6   fam_status              category
 7   income                  int64
 8   Unnamed: 0_x            int64
 9   product_id              int64
 10  product_name            object
 11  aisle_id                int64
 12  department_id           int64
 13  prices                  float64
 14  Unnamed: 0_y            int64
 15  Unnamed: 0.1            int64
 16  order_id                int64
 17  order_number            int64
 18  orders_day_of_week      int64
 19  order_hour              int64
 20  days_since_prior_order  float64
 21  add_to_cart_order       int64
 22  reordered               int64
 23  _merge                  category
 24  exists                  category
 25  max_order               int64
 26  loyalty_flag            category
 27  avg_product_price       float64
 28  spending_flag           category
 29  median_order_freq       float64
 30  freq_flag               category
 31  exis                    category
dtypes: category(9), float64(4), int64(15), object(4)
memory usage: 13.2 GB

In [27]:
# Check first 5 rows of order_products_all

order_products_all.head()

,user_id,gender,state,age,joining_date,n_dependants,fam_status,income,Unnamed: 0_x,product_id,...,reordered,_merge,exists,max_order,loyalty_flag,avg_product_price,spending_flag,median_order_freq,freq_flag,exis
0,26711,Female,Missouri,48,1/1/2017,3,married,165665,195,196,...,0,both,both,8,New customer,7.988889,Low spender,19.0,Regular customer,both
1,26711,Female,Missouri,48,1/1/2017,3,married,165665,195,196,...,1,both,both,8,New customer,7.988889,Low spender,19.0,Regular customer,both
2,26711,Female,Missouri,48,1/1/2017,3,married,165665,195,196,...,1,both,both,8,New customer,7.988889,Low spender,19.0,Regular customer,both
3,26711,Female,Missouri,48,1/1/2017,3,married,165665,6184,6184,...,0,both,both,8,New customer,7.988889,Low spender,19.0,Regular customer,both
4,26711,Female,Missouri,48,1/1/2017,3,married,165665,6184,6184,...,1,both,both,8,New customer,7.988889,Low spender,19.0,Regular customer,both

In [28]:
order_products_all.columns

Index(['user_id', 'gender', 'state', 'age', 'joining_date', 'n_dependants',
       'fam_status', 'income', 'Unnamed: 0_x', 'product_id', 'product_name',
       'aisle_id', 'department_id', 'prices', 'Unnamed: 0_y', 'Unnamed: 0.1',
       'order_id', 'order_number', 'orders_day_of_week', 'order_hour',
       'days_since_prior_order', 'add_to_cart_order', 'reordered', '_merge',
       'exists', 'max_order', 'loyalty_flag', 'avg_product_price',
       'spending_flag', 'median_order_freq', 'freq_flag', 'exis'],
      dtype='object')

In [29]:
# Remove columns that are irrelevant for analysis

order_products_all.drop(columns = ['Unnamed: 0_x', 'Unnamed: 0_y', 'Unnamed: 0.1', '_merge', 'exists', 'exis'], inplace = True)

In [30]:
order_products_all.info(memory_usage = 'deep')

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32404859 entries, 0 to 32404858
Data columns (total 26 columns):
 #   Column                  Dtype
---  ------                  -----
 0   user_id                 object
 1   gender                  category
 2   state                   category
 3   age                     object
 4   joining_date            object
 5   n_dependants            int64
 6   fam_status              category
 7   income                  int64
 8   product_id              int64
 9   product_name            object
 10  aisle_id                int64
 11  department_id           int64
 12  prices                  float64
 13  order_id                int64
 14  order_number            int64
 15  orders_day_of_week      int64
 16  order_hour              int64
 17  days_since_prior_order  float64
 18  add_to_cart_order       int64
 19  reordered               int64
 20  max_order               int64
 21  loyalty_flag            category
 22  avg_product_price       float64
 23  spending_flag           category
 24  median_order_freq       float64
 25  freq_flag               category
dtypes: category(6), float64(4), int64(12), object(4)
memory usage: 12.4 GB

In [31]:
order_products_all.head()

,user_id,gender,state,age,joining_date,n_dependants,fam_status,income,product_id,product_name,...,order_hour,days_since_prior_order,add_to_cart_order,reordered,max_order,loyalty_flag,avg_product_price,spending_flag,median_order_freq,freq_flag
0,26711,Female,Missouri,48,1/1/2017,3,married,165665,196,Soda,...,9,30.0,2,0,8,New customer,7.988889,Low spender,19.0,Regular customer
1,26711,Female,Missouri,48,1/1/2017,3,married,165665,196,Soda,...,15,11.0,1,1,8,New customer,7.988889,Low spender,19.0,Regular customer
2,26711,Female,Missouri,48,1/1/2017,3,married,165665,196,Soda,...,15,10.0,2,1,8,New customer,7.988889,Low spender,19.0,Regular customer
3,26711,Female,Missouri,48,1/1/2017,3,married,165665,6184,Clementines,...,9,NaN,1,0,8,New customer,7.988889,Low spender,19.0,Regular customer
4,26711,Female,Missouri,48,1/1/2017,3,married,165665,6184,Clementines,...,11,30.0,2,1,8,New customer,7.988889,Low spender,19.0,Regular customer

## 07. Ensure your notebook contains logical titles, section headings, and descriptive code comments.

## 08. Export this new dataframe as a pickle file so you can continue to use it in the second part of this task.

In [34]:
# Export order_products_all as order_products_all.pkl

order_products_all.to_pickle(os.path.join(path,'02 Data', 'Prepared Data', 'order_products_all.pkl'))